# python3
# -*- coding: utf-8 -*-
# @Author  : lina
# @Time    : 2018/2/7 20:47

import numpy as np
from sklearn.cluster import KMeans

data = np.array([
        [1.658985, 4.285136],
        [-3.453687, 3.424321],
        [4.838138, -1.151539],
        [-5.379713, -3.362104],
        [0.972564, 2.924086],
        [-3.567919, 1.531611],
        [0.450614, -3.302219],
        [-3.487105, -1.724432],
        [2.668759, 1.594842],
        [-3.156485, 3.191137],
        [3.165506, -3.999838],
        [-2.786837, -3.099354],
        [4.208187, 2.984927],
        [-2.123337, 2.943366],
        [0.704199, -0.479481],
        [-0.392370, -3.963704],
        [2.831667, 1.574018],
        [-0.790153, 3.343144],
        [2.943496, -3.357075],
        [-3.195883, -2.283926]
    ])


estimator = KMeans(n_clusters=3)   # 中心点数目为3
estimator.fit(data)    # 进行聚类
label_pred = estimator.labels_     # 获取聚类标签
centroids = estimator.cluster_centers_    # 获取聚类中心点
inertia = estimator.inertia_      # 获取聚类准则的总和
print(centroids)
